package cn.netinnet.cloudcommon.constant;

/**
 * @Author Linjj
 * @Date 2019/7/8 9:42
 * @Description 用户常量（用户类型/用户状态/用户性别/正则验证等）
 */
public interface UserConstant {
    /************************************ 用户类型 start ****************************************/
    /**
     * 后台管理员
     */
    int ADMIN = 0;
    /**
     * 普通管理员
     */
    int MANAGER = 1;
    /**
     * 教师
     */
    int TEACHER = 2;
    /**
     * 学生
     */
    int STUDENT = 3;
    /************************************ 用户类型 end *****************************************/

    /************************************ 用户状态 start ****************************************/
    /**
     * 可用
     */
    int STATUS_ACTIVE = 0;
    /**
     * 禁用
     */
    int STATUS_FORBIDDEN = 1;
    /************************************ 用户状态 end *****************************************/

    /************************************ 用户性别 start ****************************************/
    /**
     * 女
     */
    int SEX_FEMALE = 0;
    /**
     * 男
     */
    int SEX_MALE = 1;
    /**
     * 保密
     */
    int SEX_SECRET = 2;
    /************************************ 用户性别 end *****************************************/

    /************************************ 登录类型 start ***************************************/
    /**
     * 管理端、教师端登录
     */
    int LOGIN_TYPE_ADMIN = 0;
    /**
     * 学生端登录
     */
    int LOGIN_TYPE_STUDENT = 1;
    /************************************ 登录类型 end *****************************************/

    /**
     * 用户默认密码
     */
    String DEFAULT_PASSWORD = "123456";

    /**
     * 出题人
     */
    String CTR_LOGIN = "workflow";

    /**
     * 正保云教师角色
     */
    String ZBY_TEACHER = "zby_teacher";
}
